# 3.2 DDL: Many-to-Many Relationships

Table design principles using DDL commands, such as CREATE TABLE, DROP TABLE, ALTER TABLE, CREATE INDEX, DROP INDEX, CREATE VIEW, DROP VIEW.

Control columns values using constraints: primary keys, foreign keys, delete with CASCADE, CHECK, UNIQUE, NOT NULL, AUTOINCREMENT.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Creating many-to-many relationships

To create a many-to-many relationship, we need to create a junction table that contains foreign keys referencing the primary keys of the two tables we want to relate. This junction table will allow us to establish the many-to-many relationship between the two tables.

As stated before, foreign keys will create a relation parent-child between the two tables. The parent table is the one that contains the primary key, while the child table is the one that contains the foreign key. In a many-to-many relationship, we will have two parent tables and one child table (the junction table).

Let's see how this is done in SQL. We will create an example where our tables refer to a library system. We will have two tables: `books` and `authors`. Each book can have multiple authors, and each author can write multiple books. To create this many-to-many relationship, we will create a junction table called `book_authors` that will contain the foreign keys referencing the primary keys of the `books` and `authors` tables.

```sql
CREATE TABLE books (
    book_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    publication_year INTEGER
);
CREATE TABLE authors (
    author_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
CREATE TABLE book_authors (
    book_id INTEGER,
    author_id INTEGER,
    PRIMARY KEY (book_id, author_id),
    FOREIGN KEY (book_id) REFERENCES books(book_id) ON DELETE CASCADE,
    FOREIGN KEY (author_id) REFERENCES authors(author_id) ON DELETE CASCADE
);
```

In this example, we have created three tables: `books`, `authors`, and `book_authors`. The `book_authors` table contains two foreign keys: `book_id` and `author_id`, which reference the primary keys of the `books` and `authors` tables, respectively. The `ON DELETE CASCADE` option ensures that if a book or an author is deleted, all corresponding entries in the `book_authors` table will also be deleted automatically.

This way, we maintain referential integrity in our database.

In [2]:
%%sql

-- Let's create the tables to play with

DROP TABLE IF EXISTS books;
DROP TABLE IF EXISTS authors;
DROP TABLE IF EXISTS book_authors;

CREATE TABLE books (
    book_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    publication_year INTEGER
);

CREATE TABLE authors (
    author_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);

CREATE TABLE book_authors (
    book_id INTEGER,
    author_id INTEGER,
    PRIMARY KEY (book_id, author_id),
    FOREIGN KEY (book_id) REFERENCES books(book_id) ON DELETE CASCADE,
    FOREIGN KEY (author_id) REFERENCES authors(author_id) ON DELETE CASCADE
);

 * sqlite:///
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [3]:
%%sql
-- Let's insert some data into the tables
INSERT INTO books (book_id, title, publication_year) VALUES
(1, 'To Kill a Mockingbird', 1960),
(2, '1984', 1949),
(3, 'The Great Gatsby', 1925),
(4, 'Pride and Prejudice', 1813),
(5, 'Emma', 1813);

INSERT INTO authors (author_id, name) VALUES
(1, 'Harper Lee'),
(2, 'George Orwell'),
(3, 'F. Scott Fitzgerald'),
(4, 'Jane Austen');

INSERT INTO book_authors (book_id, author_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(1, 4), -- let's pretend Jane Austen wrote 'To Kill a Mockingbird' too
(5, 5);

 * sqlite:///
5 rows affected.
4 rows affected.
6 rows affected.

[]

In [4]:
%%sql

-- Let's see the list of books and their authors
SELECT b.title, a.name
FROM books b
JOIN book_authors ba ON b.book_id = ba.book_id
JOIN authors a ON ba.author_id = a.author_id
ORDER BY b.title;

 * sqlite:///
Done.

[('1984', 'George Orwell'),
 ('Pride and Prejudice', 'Jane Austen'),
 ('The Great Gatsby', 'F. Scott Fitzgerald'),
 ('To Kill a Mockingbird', 'Harper Lee'),
 ('To Kill a Mockingbird', 'Jane Austen')]

In [5]:
%%sql

-- Let's see what happens when we delete a book
DELETE FROM books WHERE book_id = 1;
-- Let's see the list of books and their authors again
SELECT b.title, a.name
FROM books b
JOIN book_authors ba ON b.book_id = ba.book_id
JOIN authors a ON ba.author_id = a.author_id
ORDER BY b.title;

 * sqlite:///
1 rows affected.
Done.

[('1984', 'George Orwell'),
 ('Pride and Prejudice', 'Jane Austen'),
 ('The Great Gatsby', 'F. Scott Fitzgerald')]

In [6]:
%%sql 

-- use this area to play with the database

 * sqlite:///
Done.

[]